
/*
package lesson_09;


Дан класс Solution, параметризированный T. Ограничьте параметр T.
T должен быть наследником класса ClassForGenerics и одновременно реализовывать интерфейс InterfaceForGenerics.
 Менять можно только класс Solution.



import sun.awt.SunHints;

public class Solution implements InterfaceforGenerics {

    public static <T extends ClassForGenerics> byte asByte(T num) {
        short n;
        n = num.shortValue();
        if (n >= -128 && n <= 127) {
            return ( byte n);
        } else {
            return 0;
        }
    }


    public static void main(String[] args) {
        System.out.println(asByte(9));
    }

    public void checkValue() {
    }

        System.out.println("Good job!");
    }





*/
